from my_tools.tools import timer


"""
Задача 64
Любой квадратный корень является периодическим, если записать его в виде непрерывных дробей.
Первые десять представлений непрерывных дробей (иррациональных) квадратных корней:
√2=[1;(2)], период = 1
√3=[1;(1,2)], период = 2
√5=[2;(4)], период = 1
√6=[2;(2,4)], период = 2
√7=[2;(1,1,1,4)], период = 4
√8=[2;(1,4)], период = 2
√10=[3;(6)], период = 1
√11=[3;(3,6)], период = 2
√12= [3;(2,6)], период = 2
√13=[3;(1,1,1,1,6)], период = 5
Период является нечетным у ровно четырех непрерывных дробей при N ≤ 13.
У скольких непрерывных дробей период является нечетным при N ≤ 10000?
"""


@timer
def problem_64():
    pass


if __name__ == "__main__":
    print(problem_64())
